fe40/tutorials/rheoFoam/CrossSlot/Oldroyd-BSqrt/0/b
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      b;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (1 0 0 1 0 1);

boundaryField
{

    inlet_north
    {
        type            fixedValue;
        value           uniform (1 0 0 1 0 1);
    }
    inlet_south
    {
        type            fixedValue;
        value           uniform (1 0 0 1 0 1);
    }
    walls
    {     
        type            zeroGradient;
    }  
    outlet_west
    {
         type           zeroGradient;
    }
    outlet_east
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
